# YOLOv8-RemDet (SPD-Conv + ChannelC2f) for VisDrone

# Parameters
nc: 10  # classes
scales: # model compound scaling constants
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, SPDConv, [128, 3]] # 1-P2/4 (保留你的 SPD)
  - [-1, 3, ChannelC2f, [128, True]] # 2 (替换 C2f)
  - [-1, 1, SPDConv, [256, 3]] # 3-P3/8
  - [-1, 6, ChannelC2f, [256, True]] # 4 (替换 C2f)
  - [-1, 1, SPDConv, [512, 3]] # 5-P4/16
  - [-1, 6, ChannelC2f, [512, True]] # 6 (替换 C2f)
  - [-1, 1, SPDConv, [1024, 3]] # 7-P5/32
  - [-1, 3, ChannelC2f, [1024, True]] # 8 (替换 C2f)
  - [-1, 1, SPPF, [1024, 5]]   # 9

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 3, ChannelC2f, [512]]  # 12 (Head 部分也可以替换，或者保持 C2f)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 3, ChannelC2f, [256]]  # 15

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 3, ChannelC2f, [512]]  # 18

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 3, ChannelC2f, [1024]] # 21

  - [[15, 18, 21], 1, Detect, [nc]]